app/views/questions/show.html.slim

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY best desc, created_at  [["question_id", 22]]
---

div.answers= render @question.answers.ordered