app/controllers/api/v1/answers_controller.rb

  def create
    @answer = Answer.new(answer_params.merge(question: set_question))
    if @answer.save
---
INSERT INTO "answers" ("question_id", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 45], ["body", "фывфыв"], ["user_id", 2], ["created_at", "2018-03-09 17:31:48.694790"], ["updated_at", "2018-03-09 17:31:48.694790"]]

  def update
    if @answer.update(answer_params)
---
UPDATE "answers" SET "body" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["body", "vefecesasd"], ["updated_at", "2018-03-10 18:16:46.384352"], ["id", 58]]

  def set_question
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]