app/controllers/api/v1/questions_controller.rb

  def create
    @question = current_user.questions.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "erwdfsdf"], ["body", "sdfsddf"], ["user_id", 2], ["created_at", "2018-03-07 14:39:35.858830"], ["updated_at", "2018-03-07 14:39:35.858830"]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "zcxzczrert"], ["updated_at", "2018-03-09 13:59:02.125700"], ["id", 45]]