backend/app/controllers/api/v1/answers_controller.rb

INSERT INTO "answers" ("question_id", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 47], ["body", "414"], ["user_id", 2], ["created_at", "2018-03-16 23:48:25.635770"], ["updated_at", "2018-03-16 23:48:25.635770"]]
---
  def create
    @answer = Answer.new(answer_params.merge(question: set_question))
    if @answer.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
---
  def set_question
    @question = Question.find(params[:question_id])