backend/app/controllers/api/v1/questions_controller.rb

  def create
    @question = current_user.questions.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testsdf"], ["body", "ssdffes"], ["user_id", 2], ["created_at", "2018-03-16 23:15:17.664398"], ["updated_at", "2018-03-16 23:15:17.664398"]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "tets675"], ["updated_at", "2018-03-16 23:14:35.830323"], ["id", 43]]