app/controllers/answers_controller.rb

  def create
    respond_with(@answer = Answer.create(answer_params))
---
INSERT INTO "answers" ("question_id", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 1], ["body", "test answer"], ["user_id", 1], ["created_at", "2017-12-30 20:30:35.957180"], ["updated_at", "2017-12-30 20:30:35.957180"]]

  def update
    @answer.update(answer_params)
---
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "435345345best"], ["updated_at", "2017-12-01 00:10:10.975621"], ["id", 2]]

  def destroy
    @answer_id = @answer.id
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 12]]

  def set_question
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]