app/controllers/attachments_controller.rb

SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 53]]
---
  def destroy
    @attachment = Attachment.find(params[:id])
    @attachment.destroy if @attachment.attachmentable.user == current_user