app/controllers/questions_controller.rb

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "title" = ?, "body" = ? WHERE "questions"."id" = ?  [["title", "new title"], ["body", "new_body"], ["id", 1]]

  def create
    @question = current_user.questions.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test question"], ["body", "what for it question?"], ["user_id", 1], ["created_at", "2017-12-29 15:29:13.755760"], ["updated_at", "2017-12-29 15:29:13.755760"]]

  def destroy
    if @question.user == current_user
      stream_question(:destroy)
      @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 4]]