app/controllers/votes_controller.rb

  def set_post
    case params[:post_type]
      when 'answer'
        @post = Answer.find(params[:id])
      when 'question'
        @post = Question.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]